Revit 2020 API
Dimension.IsTextPositionAdjustable Method
 Indicates if this dimension is supported to set/get TextPosition/LeaderPosition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2015 Subscription Update
Syntax
C#
public bool IsTextPositionAdjustable()
Visual Basic
Public Function IsTextPositionAdjustable As Boolean
Visual C++
public:
bool IsTextPositionAdjustable()
See Also
Dimension Class
Autodesk.Revit.DB Namespace